src/integration-test/resources/templates/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header />
  <soapenv:Body>
    <request xmlns="http://g.rimsa.lt/rest-via-soap/" method="${method}" path="${path}">${body}</request>
  </soapenv:Body>
</soapenv:Envelope>